<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class socialStatusSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $social_statuses = [
            ['id' => '1','name' => 'Кам таъминланган оила фарзанди (ИҲЯР)'],
            ['id' => '2','name' => 'Aжрим ёқасида'],
            ['id' => '3','name' => 'Нотинч оиладаги аёл'],
            ['id' => '4','name' => 'Ногиронлиги бор'],
            ['id' => '5','name' => 'Ногирон фарзанд тарбиялаётган'],
            ['id' => '6','name' => 'Ҳарбий хизматдан қайтган лекин ишга жойлаша олмаган шахс'],
            ['id' => '7','name' => 'Етимлик (чин, ярим, ижтимоий) тоифасидан бирига киради'],
            ['id' => '8','name' => 'Жазони ижро этиш муассасасидан қайтган шахс'],
            ['id' => '9','name' => 'Оилавий зўравонлик қурбони бўлган аёл'],
            ['id' => '10','name' => 'Уй-жойга эҳтиёжи бор'],
            ['id' => '11','name' => 'Ижтимоий кўмак кўрсатилганлар'],
            ['id' => '12','name' => 'Ижтимоий фаол ёшлар'],
            ['id' => '13','name' => 'Нафақа олувчилар'],
            ['id' => '14','name' => 'Бошпанасиз ёшлар'],
            ['id' => '15','name' => 'Алоҳида назоратда турувчи ёшлар'],
            ['id' => '16','name' => 'Боқувчисини йўқотганлар'],
            ['id' => '17','name' => 'Миграциядан қайтганлар'],
            ['id' => '18','name' => 'Темир дафтардаги оила фарзандлари']
        ];
        DB::table('social_statuses')->insert($social_statuses);
    }
}
